nscooling/gccMinimal_LPC1768/src/main.c
#pragma import(__use_no_semihosting_swi)

//#include "leds.h"
#include "serial.h"
#include "timer.h"
#include "LPC17xx.h"


/* Scheduler includes. */
#include "FreeRTOS.h"
#include "task.h"

#include "ParTest.h"
/*-----------------------------------------------------------*/

/* The time between cycles of the 'check' functionality (defined within the
tick hook). */
#define mainCHECK_DELAY           ( ( portTickType ) 5000 / portTICK_RATE_MS )

/* The toggle rate for the LED. */
#define mainLED_TOGGLE_RATE         ( ( portTickType ) 1000 / portTICK_RATE_MS )

/* Task priorities. */
#define mainQUEUE_POLL_PRIORITY       ( tskIDLE_PRIORITY + 2 )
#define mainSEM_TEST_PRIORITY       ( tskIDLE_PRIORITY + 1 )
#define mainBLOCK_Q_PRIORITY        ( tskIDLE_PRIORITY + 2 )
#define mainUIP_TASK_PRIORITY       ( tskIDLE_PRIORITY + 3 )
#define mainFLASH_TASK_PRIORITY       ( tskIDLE_PRIORITY + 2 )
#define mainINTEGER_TASK_PRIORITY           ( tskIDLE_PRIORITY )
#define mainGEN_QUEUE_TASK_PRIORITY     ( tskIDLE_PRIORITY )

/* The WEB server has a larger stack as it utilises stack hungry string
handling library calls. */
#define mainBASIC_WEB_STACK_SIZE            ( configMINIMAL_STACK_SIZE * 4 )

/* The message displayed by the WEB server when all tasks are executing
without an error being reported. */
#define mainPASS_STATUS_MESSAGE       "All tasks are executing without error."

/* Bit definitions. */
#define PCONP_PCGPIO    0x00008000
#define PLLFEED_FEED1   0x000000AA
#define PLLFEED_FEED2   0x00000055
/*-----------------------------------------------------------*/

/*
 * Configure the hardware for the demo.
 */
static void prvSetupHardware( void );

/*
 * The task that handles the uIP stack.  All TCP/IP processing is performed in
 * this task.
 */
extern void vuIP_Task( void *pvParameters );

/*
 * The task that handles the USB stack.
 */
extern void vUSBTask( void *pvParameters );


/*
 * Very basic task that does nothing but use delays to flash an LED.
 */
static void prvFlashTask( void *pvParameters );
static void prvFlashTask2( void *pvParameters );

/*
 * Simply returns the current status message for display on served WEB pages.
 */
char *pcGetTaskStatusMessage( void );

/*-----------------------------------------------------------*/

/* Holds the status message displayed by the WEB server. */
static char *pcStatusMessage = mainPASS_STATUS_MESSAGE;

/*-----------------------------------------------------------*/

int main( void )
{
//char cIPAddress[ 16 ]; /* Enough space for "xxx.xxx.xxx.xxx\0". */

  /* Configure the hardware for use by this demo. */
  prvSetupHardware();

  /* Start the standard demo tasks.  These are just here to exercise the
  kernel port and provide examples of how the FreeRTOS API can be used. */
  //vStartBlockingQueueTasks( mainBLOCK_Q_PRIORITY );
  //  vCreateBlockTimeTasks();
  //  vStartSemaphoreTasks( mainSEM_TEST_PRIORITY );
  //  vStartPolledQueueTasks( mainQUEUE_POLL_PRIORITY );
  //  vStartIntegerMathTasks( mainINTEGER_TASK_PRIORITY );
  //  vStartGenericQueueTasks( mainGEN_QUEUE_TASK_PRIORITY );
  //  vStartQueuePeekTasks();
  //  vStartRecursiveMutexTasks();
  //vStartLEDFlashTasks( mainFLASH_TASK_PRIORITY );

    /* Create the USB task. */
  //  xTaskCreate( vUSBTask, "USB", configMINIMAL_STACK_SIZE, ( void * ) NULL, tskIDLE_PRIORITY, NULL );

  /* Display the IP address, then create the uIP task.  The WEB server runs
  in this task. */
  //LCDdriver_initialisation();
  //LCD_PrintString( 5, 10, "FreeRTOS.org", 14, COLOR_GREEN);
  //sprintf( cIPAddress, "%d.%d.%d.%d", configIP_ADDR0, configIP_ADDR1, configIP_ADDR2, configIP_ADDR3 );
  //LCD_PrintString( 5, 30, cIPAddress, 14, COLOR_RED);
   // xTaskCreate( vuIP_Task, "uIP", mainBASIC_WEB_STACK_SIZE, ( void * ) NULL, mainUIP_TASK_PRIORITY, NULL );

  /* Create the simple LED flash task. */
  xTaskCreate( prvFlashTask, "Flash", configMINIMAL_STACK_SIZE, ( void * ) NULL, mainFLASH_TASK_PRIORITY, NULL );
  xTaskCreate( prvFlashTask2, "Flash2", configMINIMAL_STACK_SIZE, ( void * ) NULL, mainFLASH_TASK_PRIORITY, NULL );

    /* Start the scheduler. */
  vTaskStartScheduler();

    /* Will only get here if there was insufficient memory to create the idle
    task.  The idle task is created within vTaskStartScheduler(). */
  for( ;; );
}

static void prvFlashTask( void *pvParameters )
{
portTickType xLastFlashTime;
unsigned i;

  /* We need to initialise xLastFlashTime prior to the first call to
  vTaskDelayUntil(). */
  xLastFlashTime = xTaskGetTickCount();

  for(;;)
  {
    /* Simply toggle the LED between delays. */
    for(i = 0; i < 2; ++i) {
    vTaskDelayUntil( &xLastFlashTime, mainLED_TOGGLE_RATE );
    vParTestToggleLED( i );
  }
  }
}
static void prvFlashTask2( void *pvParameters )
{
portTickType xLastFlashTime;
unsigned i;

  /* We need to initialise xLastFlashTime prior to the first call to
  vTaskDelayUntil(). */
  xLastFlashTime = xTaskGetTickCount();

  for(;;)
  {
    /* Simply toggle the LED between delays. */
    for(i = 2; i < 4; ++i) {
    vTaskDelayUntil( &xLastFlashTime, mainLED_TOGGLE_RATE/10 );
    vParTestToggleLED( i );
  }
  }
}

void vApplicationTickHook( void )
{
static unsigned long ulTicksSinceLastDisplay = 0;

  /* Called from every tick interrupt as described in the comments at the top
  of this file.

  Have enough ticks passed to make it time to perform our health status
  check again? */
  ulTicksSinceLastDisplay++;
  if( ulTicksSinceLastDisplay >= mainCHECK_DELAY )
  {
    /* Reset the counter so these checks run again in mainCHECK_DELAY
    ticks time. */
    ulTicksSinceLastDisplay = 0;
#if 0
    /* Has an error been found in any task? */
    if( xAreGenericQueueTasksStillRunning() != pdTRUE )
    {
      pcStatusMessage = "An error has been detected in the Generic Queue test/demo.";
    }
    else if( xAreQueuePeekTasksStillRunning() != pdTRUE )
    {
      pcStatusMessage = "An error has been detected in the Peek Queue test/demo.";
    }
    else if( xAreBlockingQueuesStillRunning() != pdTRUE )
    {
      pcStatusMessage = "An error has been detected in the Block Queue test/demo.";
    }
    else if( xAreBlockTimeTestTasksStillRunning() != pdTRUE )
    {
      pcStatusMessage = "An error has been detected in the Block Time test/demo.";
    }
      else if( xAreSemaphoreTasksStillRunning() != pdTRUE )
      {
          pcStatusMessage = "An error has been detected in the Semaphore test/demo.";
      }
      else if( xArePollingQueuesStillRunning() != pdTRUE )
      {
          pcStatusMessage = "An error has been detected in the Poll Queue test/demo.";
      }
      else if( xAreIntegerMathsTaskStillRunning() != pdTRUE )
      {
          pcStatusMessage = "An error has been detected in the Int Math test/demo.";
      }
      else if( xAreRecursiveMutexTasksStillRunning() != pdTRUE )
      {
        pcStatusMessage = "An error has been detected in the Mutex test/demo.";
      }
#endif
  }
}
/*-----------------------------------------------------------*/

char *pcGetTaskStatusMessage( void )
{
  /* Not bothered about a critical section here. */
  return pcStatusMessage;
}
/*-----------------------------------------------------------*/

void prvSetupHardware( void )
{
  /* Disable peripherals power. */
  LPC_SC->PCONP = 0;

  /* Enable GPIO power. */
  LPC_SC->PCONP = PCONP_PCGPIO;

  /* Disable TPIU. */
  LPC_PINCON->PINSEL10 = 0;

  if ( LPC_SC->PLL0STAT & ( 1 << 25 ) )
  {
    /* Enable PLL, disconnected. */
    LPC_SC->PLL0CON = 1;
    LPC_SC->PLL0FEED = PLLFEED_FEED1;
    LPC_SC->PLL0FEED = PLLFEED_FEED2;
  }

  /* Disable PLL, disconnected. */
  LPC_SC->PLL0CON = 0;
  LPC_SC->PLL0FEED = PLLFEED_FEED1;
  LPC_SC->PLL0FEED = PLLFEED_FEED2;

  /* Enable main OSC. */
  LPC_SC->SCS |= 0x20;
  while( !( LPC_SC->SCS & 0x40 ) );

  /* select main OSC, 12MHz, as the PLL clock source. */
  LPC_SC->CLKSRCSEL = 0x1;

  LPC_SC->PLL0CFG = 0x20031;
  LPC_SC->PLL0FEED = PLLFEED_FEED1;
  LPC_SC->PLL0FEED = PLLFEED_FEED2;

  /* Enable PLL, disconnected. */
  LPC_SC->PLL0CON = 1;
  LPC_SC->PLL0FEED = PLLFEED_FEED1;
  LPC_SC->PLL0FEED = PLLFEED_FEED2;

  /* Set clock divider. */
  LPC_SC->CCLKCFG = 0x03;

  /* Configure flash accelerator. */
  LPC_SC->FLASHCFG = 0x403a;

  /* Check lock bit status. */
  while( ( ( LPC_SC->PLL0STAT & ( 1 << 26 ) ) == 0 ) );

  /* Enable and connect. */
  LPC_SC->PLL0CON = 3;
  LPC_SC->PLL0FEED = PLLFEED_FEED1;
  LPC_SC->PLL0FEED = PLLFEED_FEED2;
  while( ( ( LPC_SC->PLL0STAT & ( 1 << 25 ) ) == 0 ) );




  /* Configure the clock for the USB. */

  if( LPC_SC->PLL1STAT & ( 1 << 9 ) )
  {
    /* Enable PLL, disconnected. */
    LPC_SC->PLL1CON = 1;
    LPC_SC->PLL1FEED = PLLFEED_FEED1;
    LPC_SC->PLL1FEED = PLLFEED_FEED2;
  }

  /* Disable PLL, disconnected. */
  LPC_SC->PLL1CON = 0;
  LPC_SC->PLL1FEED = PLLFEED_FEED1;
  LPC_SC->PLL1FEED = PLLFEED_FEED2;

  LPC_SC->PLL1CFG = 0x23;
  LPC_SC->PLL1FEED = PLLFEED_FEED1;
  LPC_SC->PLL1FEED = PLLFEED_FEED2;

  /* Enable PLL, disconnected. */
  LPC_SC->PLL1CON = 1;
  LPC_SC->PLL1FEED = PLLFEED_FEED1;
  LPC_SC->PLL1FEED = PLLFEED_FEED2;
  while( ( ( LPC_SC->PLL1STAT & ( 1 << 10 ) ) == 0 ) );

  /* Enable and connect. */
  LPC_SC->PLL1CON = 3;
  LPC_SC->PLL1FEED = PLLFEED_FEED1;
  LPC_SC->PLL1FEED = PLLFEED_FEED2;
  while( ( ( LPC_SC->PLL1STAT & ( 1 << 9 ) ) == 0 ) );

  /*  Setup the peripheral bus to be the same as the PLL output (64 MHz). */
  LPC_SC->PCLKSEL0 = 0x05555555;

  /* Configure the LEDs. */
  vParTestInitialise();
}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( xTaskHandle pxTask, char *pcTaskName )
{
  /* This function will get called if a task overflows its stack. */

  ( void ) pxTask;
  ( void ) pcTaskName;

  for( ;; );
}
/*-----------------------------------------------------------*/

void vConfigureTimerForRunTimeStats( void )
{
const unsigned long TCR_COUNT_RESET = 2, CTCR_CTM_TIMER = 0x00, TCR_COUNT_ENABLE = 0x01;

  /* This function configures a timer that is used as the time base when
  collecting run time statistical information - basically the percentage
  of CPU time that each task is utilising.  It is called automatically when
  the scheduler is started (assuming configGENERATE_RUN_TIME_STATS is set
  to 1). */

  /* Power up and feed the timer. */
  LPC_SC->PCONP |= 0x02UL;
  LPC_SC->PCLKSEL0 = (LPC_SC->PCLKSEL0 & (~(0x3<<2))) | (0x01 << 2);

  /* Reset Timer 0 */
  LPC_TIM0->TCR = TCR_COUNT_RESET;

  /* Just count up. */
  LPC_TIM0->CTCR = CTCR_CTM_TIMER;

  /* Prescale to a frequency that is good enough to get a decent resolution,
  but not too fast so as to overflow all the time. */
  LPC_TIM0->PR =  ( configCPU_CLOCK_HZ / 10000UL ) - 1UL;

  /* Start the counter. */
  LPC_TIM0->TCR = TCR_COUNT_ENABLE;
}
/*-----------------------------------------------------------*/

